# "Шифровка"
# Секретное агентство «Super-Secret-no» решило
# для шифрования переписки своих сотрудников использовать «метод бутерброда».
# Сначала буквы слова нумеруются в таком порядке:
# первая буква получает номер 1,
# последняя буква - номер 2,
# вторая – номер 3,
# предпоследняя – номер 4, потом третья … и так для всех букв (см. рисунок).
# Затем все буквы записываются в шифр в порядке своих номеров.
#
# Например, слово «sandwich» зашифруется в «shacnidw».
#
# К сожалению, программист «Super-Secret-no», написал только программу шифрования и уволился.
# И теперь агенты не могут понять, что же они написали друг другу. Помогите им.
#
# Пример:
# Введите зашифрованное сообщение: shacnidw
# Расшифрованное сообщение: sandwich
#          1   3   5   7   8   6   4   2
# Слово: | s | a | n | d | w | i | c | h |
#
# Шифр:  | s | h | a | c | n | i | d | w |


def decrypt(message):
    decrypt_mes = ''
    mes_len = len(message)
    i = 0
    while i < mes_len:
        decrypt_mes += message[i]
        i += 2
    i = mes_len - 1 - mes_len % 2
    while i > 0:
        decrypt_mes += message[i]
        i -= 2
    return decrypt_mes


message = input("Введите зашифрованное сообщение: ")
print("Расшифрованное сообщение:", decrypt(message))
