# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

s = ''
for name in names:
    s += name+', '

s = s[:-2]
print(s)
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
